[
    {
        "fact": "Abhishek Bansal is an aspiring full stack developer passionate about web development, debugging, and API development."
    },
    {
        "fact": "He is proficient in multiple programming languages including JavaScript, C++, Python, and SQL."
    },
    {
        "fact": "Abhishek has strong frontend skills in HTML/CSS, ReactJS, NextJS, and frameworks like Tailwind and Bootstrap."
    },
    {
        "fact": "On the backend, he is experienced with NodeJS, ExpressJS, and database management using MongoDB."
    },
    {
        "fact": "Tools and platforms he frequently uses include Git, Visual Studio/VS Code, Canva, and ChatGPT."
    },
    {
        "fact": "Currently interning at Explorin.io as a Web Development Intern, where he develops and maintains high-performance web applications using the MERN stack."
    },
    {
        "fact": "Abhishek is pursuing a Bachelor of Technology in Computer Science from Dr. A.P.J. Abdul Kalam Technical University, with a CGPA of 7.3."
    },
    {
        "fact": "He completed his Senior Secondary Education at De Paul School, Bilari, Moradabad, with a percentage of 71.6%."
    },
    {
        "fact": "During his Secondary Education at De Paul School, Bilari, Moradabad, he secured a percentage of 76.4%."
    },
    {
        "fact": "He developed a comprehensive E-Commerce Website using ReactJS, Firebase/Firestore, Bootstrap, HTML, Tailwind CSS, and MongoDB, providing a solid online shopping experience."
    },
    {
        "fact": "Abhishek also built 'MyPortfolio,' a responsive web application using ReactJS, CSS, ThreeJS, and JavaScript, featuring interactive 3D visualizations."
    },
    {
        "fact": "He participated in the Internal Smart Indian Hackathon 2023, showcasing his problem-solving and coding skills."
    },
    {
        "fact": "Abhishek secured a Silver Medal in the AKTU Zonals Kho Kho Competition, demonstrating his athleticism and team spirit."
    },
    {
        "fact": "He was the winner of 'The Styling Geek,' a website design competition held by CSSS at MIT, highlighting his creativity and design skills."
    },
    {
        "fact": "As the Chief Editor of the College Newsletter, Abhishek oversaw the editorial process, curated content, and managed a team to ensure high-quality publications."
    },
    {
        "fact": "He served as the Student Coordinator of the Hobbies Club, organizing over 20 activities, leading to a 30% increase in student participation."
    },
    {
        "fact": "Abhishek designed eye-catching posters for over 12 events, which led to a 40% increase in attendance, showcasing his visual communication skills."
    },
    {
        "fact": "He is a self-taught developer, continuously learning new technologies and frameworks to stay updated with the latest trends in web development."
    },
    {
        "fact": "Abhishek is a quick learner, able to grasp new concepts and implement them effectively in projects, ensuring high-quality deliverables."
    },
    {
        "fact": "He is a team player, collaborating with cross-functional teams to achieve project milestones and deliver exceptional results."
    },
    {
        "fact": "Abhishek is a detail-oriented individual, focusing on the finer aspects of development to create seamless user experiences and interfaces."
    },
    {
        "fact": "He has excellent problem-solving skills, capable of troubleshooting issues and optimizing code to enhance application performance."
    }
]